'use client';

import React from 'react';
import { useRouter } from 'next/navigation';
import { Button } from '@/components/ui/button';
import { useTranslations } from 'next-intl';
import PageContainer from '@/components/layout/page-container';


const PrivacyPolicy = () => {
  const router = useRouter();
  const t = useTranslations();

  return (
    <PageContainer scrollable={true}>
    <div className="container mx-auto px-4 py-8 mt-2">
      <h1 className="text-3xl font-bold mb-6 text-center">מדיניות פרטיות</h1>
      <p className="mb-4">
        מדיניות פרטיות זו (להלן: ״מדיניות פרטיות״) חלה על האופן שבו אנו, בשופנדה בע״מ, בעלת הזכויות ומפעילת שירות מיזמי ו/או
        שופנדה (MIZEMI / Shopanda) (להלן: ״החברה״, ״אנו״, ״שלנו״ או ״אנחנו״), משתמשים במידע אישי הנאסף, מתקבל או
        נשמר על ידינו במסגרת הפעילות שלנו ובכלל זה במסגרת אתרי האינטרנט שלנו: https://mizemiapp.com/ ו/או
        https://mizemi.app, ו/או https://shopanda.io לרבות אתרי המשנה שלהם, תכניהם והשירותים המוצעים בהם (להלן ביחד:
        ״האתרים״) ובמסגרת האפליקציות שלנו (להלן ביחד: ״השירות״ או ״השירותים״). העושה כל שימוש בשירותים שלנו, בחינם או
        בתשלום, בין אם מדובר בגולש המבקר באתרים, באפליקציות או בגולש שהגיע כהפניה ממשתמש אחר (להלן: ״גולש״) ובין אם
        מדובר בנציג העושה שימוש בשירות מטעם מפיק, מנהל קהילה, מוסד חינוכי, עסק או רשות (להלן בהתאמה: ״נציג״ ו-״ארגון״)
        (גולש ונציג, להלן ביחד: ״המשתמש״). מדיניות הפרטיות מנוסחת בלשון זכר לשם הנוחות בלבד, אך פונה באופן שווה לכולן
        וכולם.
      </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">1. מבוא</h2>
      <p className="mb-4">
        מדיניות פרטיות זו מיושמת משום שאנו מכירים בחשיבותה של הפרטיות שלך. מדיניות פרטיות זו מפרטת את אופן
        ניהול המידע האישי שייאסף במסגרת הפעילות שלנו, ואת הבחירות שתוכלו לבצע בנוגע לאופן שבו מידע זה ייאסף וישמש
        במסגרת האתרים ו/או האפליקציות.
      </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">2. מהו מידע אישי</h2>
      <p className="mb-4">
        ״מידע״ או ״מידע אישי״ כהגדרתו בחוק הגנת הפרטיות, תשמ״א – 1981 (להלן: ״חוק הגנת הפרטיות״) ובכלל זה מידע המתייחס
        לאדם מזוהה או אדם הניתן לזיהוי. למשל: נתונים על אישיותו של אדם, מעמדו האישי, פרטים אינטימיים לגביו ולגבי חייו,
        מצבו הבריאותי, מצבו הכלכלי, הכשרתו המקצועית, מיקומו הגיאוגרפי, דעותיו ואמונתו.
      </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">3. תנאי שימוש</h2>
      <p className="mb-4">
        מדיניות פרטיות זו הנה חלק מתנאי השימוש באתרים ובאפליקציות. כדי להבין טוב יותר את כלל השירותים והתנאים באתרים
        ובאפליקציות, אנא עיינו בתנאי השימוש המפורסמים בכתובת [כתובת ה-URL של תנאי השימוש] (להלן: ״תנאי השימוש״).
        כל מונחים מודגשים שאינם מוגדרים במדיניות הפרטיות, יישאו את המשמעות שניתנה להם בתנאי השימוש.
      </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">4. הסכמה ושינוי מדיניות הפרטיות</h2>
      <p className="mb-4">
        אינך מחויב משפטית למסור לנו מידע אישי, והנך מאשר בזאת כי מסירת המידע האישי מתבצעת מרצונך החופשי. גלישתך
        באתרים ו/או באפליקציות ומסירת מידע אישי לחברה בכל מסגרת שהיא, מהווה את הסכמתך לתנאי מדיניות הפרטיות בעת
        שימושך, ובין היתר לאיסוף, עיבוד ושיתוף מידע אישי, כמפורט בה. אם אינך מסכים למדיניות הפרטיות במלואה, הנך מתבקש
        שלא לעשות כל שימוש באתרים ו/או באפליקציות. אנו שומרים על הזכות לשנות את מדיניות הפרטיות בכל עת, ולכן אנו
        מבקשים ממך לבדוק באופן קבוע את הגרסה העדכנית ביותר של מדיניות הפרטיות הזו. ככל שיתבצע עדכון מהותי באופן שבו
        אנו משתמשים במידע שלך, בצורה שונה מזו שהוצגה בעת האיסוף, אנו נעדכן אותך בדבר השינוי. הכניסה שלך לאתרים
        ו/או לאפליקציות והמשך השימוש שלך בשירות לאחר כניסת השינויים האמורים לתוקפם יהווה הסכמתך לשינויים.
      </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">5. פרטיות קטינים</h2>
      <p className="mb-4">
        אנו נאפשר שימוש באתרים ו/או באפליקציות גם למי שהינו מתחת לגיל 18 ובלבד שנתקבלה הסכמת האפוטרופוס החוקי לצורך
        שימוש באתרים ו/או באפליקציות ומסירת מידע. המשך השימוש ומסירת המידע כאמור, לרבות הוספת אמצעי תשלום, מהווה
        אישור כי הסכמה כאמור ניתנה כנדרש. אם אתם מאמינים שעשוי להיות לנו מידע על קטינים מתחת לגיל 18 ללא שהתקבלה
        הסכמת האפוטרופוס החוקי, אנא צרו עמנו קשר בדוא״ל hello@mizemi.app.
      </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">
        6. סוג המידע האישי הנאסף על ידינו ואופן איסופו
      </h2>

      <h3 className="text-xl font-bold mt-4 mb-2">מידע שאנחנו אוספים ביחס לגולשים:</h3>
      <p className="mb-4">
        6.1. מידע שאתה מספק לנו כשאתה נרשם לשירות כגולש. אנו אוספים את שמך המלא, מגדרך, מספר הטלפון שלך,
        כתובת הדוא״ל, סיסמה, תמונה או תמונה מהפרופיל הציבורי שלך (במידה ובחרת להירשם באמצעות פרטי
        ההתחברות שלך בפייסבוק, באפל או בגימייל), מיקומך אם אישרת הרשאת מיקום או אם אישרת כניסה למרחב
        פיזי בו עושים שימוש בשירותים שלנו, סוג המכשיר בו אתה עושה שימוש, סוג וגרסת מערכת ההפעלה בה אתה
        עושה שימוש, כתובת ה-IP. ללא הסכמתך לאיסוף מידע זה, לא נוכל לאפשר את הרשמתך לשירות ופתיחת חשבון
        עבורך.
      </p>

      <p className="mb-4">
        6.2. המידע שאתה מספק לנו במסגרת השימוש במאפיין הארנק שלנו כגולש. לגבי פרטי החיוב ואמצעי התשלום
        שלך, נציין כי הסליקה והעיבוד של פרטי החיוב ואמצעי התשלום מתבצעים באמצעות ספק שירותי סליקה חיצוני
        ומאובטח העומד בתקנים הרלוונטים. בהתאם לכך, השימוש והאחסון של פרטי החיוב ואמצעי התשלום כפופים
        למדיניות הפרטיות של ספק זה. לכן, אנו לא אוספים או שומרים פרטי החיוב או אמצעי התשלום בשום שלב, ואנו
        לא עושים בהם כל שימוש למעט לצורך ביצוע הסליקה. כאשר אתה משתמש במאפיין הארנק שלנו, תצטרך לספק
        לנו את שמך המלא, תמונה שלך, מספר תעודת זהות, פרטי חיוב ואמצעי התשלום שתבחר לספק לנו כגון חשבון
        ה-PayPal שלך או כתובת ה-Bitcoin שלך. אנחנו עשויים לקבל מידע מסוים לזיהוי לקוח מחברות האשראי כגון
        ארבע ספרות אחרונות של הכרטיס שהזנת, טוקן שניתן לכרטיס וכל מידע שמהווה חלק אינטגרלי במתן השירותים
        שלנו. ללא איסוף מידע זה, לא נוכל לאפשר את שימושך במאפיין הארנק שלנו ולא נוכל להשלים את העסקאות
        שאתה מבצע.
      </p>

      <p className="mb-4">
        6.3. המידע שאתה מספק לנו במסגרת השימוש בשירות שלנו, במסגרת האתרים ו/או האפליקציות. אנו אוספים
        מידע אישי שאתה מספק לנו מרצונך החופשי, כגון שמך המלא, כתובת הדוא״ל, סיסמה, מגדרך, תמונת הפרופיל
        שלך, מספר הטלפון שלך, קישור לאתרי האינטרנט שלך, תאריך לידתך, עיר מגוריך, השכלתך, מקצועך, מצבך
        המשפחתי / סטטוס זוגיות, גובהך, תחביביך, מיקומך, סוג המכשיר בו אתה עושה שימוש, סוג וגרסת מערכת
        ההפעלה בה אתה עושה שימוש, כתובת ה-IP - ופרטים אחרים אודותיך אם תבחר לפרטם בטקסט חופשי וכן כל
        מידע נוסף שתחליט לספק לנו או שנולד כתוצאה מהשימוש בשירותים כמו למשל אינטראקציות מול משתמשים
        אחרים או עסקים העושים שימוש בשירותים שלנו, היסטוריית הרכישות שלך במסגרת השירותים שלנו ושל צדדים
        שלישיים העושים שימוש בשירותים שלנו. אם לא תספק את המידע הנדרש, ייתכן שלא נוכל לספק לך את
        השירות ו/או לא נוכל לעדכן אותך בשינויים ו/או בהודעות חשובות הקשורות לשירות שלנו.
      </p>

      <h3 className="text-xl font-bold mt-4 mb-2">מידע שאנחנו אוספים ביחס לנציגים:</h3>
      <p className="mb-4">
        6.4. מידע שאתה מספק לנו כשאתה נרשם לשירות כנציג. אנו אוספים את שמך המלא, שם הארגון שאתה מייצג,
        מספר הטלפון שלך, כתובת הדוא״ל, סיסמה, סוג המכשיר בו אתה עושה שימוש, סוג וגרסת מערכת ההפעלה בה
        אתה עושה שימוש, כתובת ה-IP, וכן כל מידע נוסף שתחליט לספק לנו כמו מיקומך בנוסף. במהלך שימושך
        בשירות מטעם הארגון אנו עשויים לאסוף מידע לגבי השימוש שלך בשירות ולגבי הפעילות שלך בשירות כמו זמני
        ההתחברות שלך וזמני עבודה. ללא הסכמתך לאיסוף מידע זה, לא נוכל לאפשר את הרשמתך לשירות ופתיחת
        חשבון עבורך.
      </p>

      <h3 className="text-xl font-bold mt-4 mb-2">מידע נוסף שאנחנו אוספים ביחס לנציגים וגולשים:</h3>
      <p className="mb-4">
        6.5. מידע שאתה מספק לנו כשאתה יוצר קשר איתנו. אנחנו עשויים לאסוף עוד מידע מזהה אודותיך אשר יצטבר
        במקרה שבו תצור איתנו קשר כך שנצטרך לשמור את המידע הזה לצרכי השירות. ללא איסוף מידע זה, לא נוכל
        לייצור איתך קשר ולענות על השאלות שלך.
      </p>

      <p className="mb-4">
        6.6. מידע וניתוחים סטטיסטיים ממקורות שונים שאינם מאפשרים זיהוי אישי. אנו אוספים מידע וניתוחים
        סטטיסטיים ממקורות שונים שאינם מאפשרים זיהוי אישי. מידע שאינו מזהה אישית הוא לא מידע אישי, אבל ביחד
        עם עוד פרטי מידע הוא יכול להצביע או ללמד על משהו הקשור בך (לדוגמא, רשימת העמודים הנצפים באתר
        מסוים יכולה ללמד מה הם תחביביך). לכן, חשוב שנציין כי המידע הלא מזהה שנאסף אודותיך הוא מידע סטטיסטי
        ולא מפולח אישית. ללא איסוף מידע זה, לא נוכל להציג לך הודעות רלוונטיות עבורך ולא נוכל להתאים את השירות
        שלנו להעדפות שלך.
      </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">
        7. לאילו מטרות אנו אוספים את המידע
      </h2>

      <p className="mb-4">
        7.1. כדי לאפשר לך לעשות שימוש באתרים ו/או באפליקציות שלנו וכדי לספק לך את השירות שלנו. המידע האישי
        שייאסף לגביך ישמש לניהול ההרשמה והצטרפותך לשירות שלנו, כדי לספק לך את השירות שלנו, כדי לענות על
        שאלותיך ולאפשר לך לתקשר איתנו, כדי לשלוח לך עדכונים, דיורים והצעות בנוגע לשירותים שלנו ו/או בנושאים
        שאנחנו סבורים שאתה עשוי למצוא בהם עניין, לרבות פרסומות, לצורך מתן תמיכה וטיפול בבקשותיך או תלונותיך,
        כדי לנתח את השימוש שלך באתרים ו/או באפליקציות שלנו ולשפרם, וכדי להתאים אישית את החוויה שלך.
      </p>

      <p className="mb-4">
        7.2. כדי לאפשר לך כגולש להשתמש במאפיין הארנק. אנחנו נשתמש במידע שלך כדי לספק לך את השירותים
        המוצעים דרך מאפיין הארנק, וכדי שתוכל לבצע עסקאות ו/או רכישות מבוססות יתרה שרכשת מראש, להשתמש
        במאפיין הארנק אל מול מפיקי אירועים, עסקים, מוסדות חינוך, ארגונים וקהילות העושים שימוש בשירותים.
      </p>

      <p className="mb-4">
        7.3. כדי לשלוח לך כגולש הודעות PUSH באמצעות השירות. אנחנו נשתמש במידע שלך (ללא פרטים מזהים) כדי
        להציג הודעת PUSH למשתמש אחר במקרה שתשלח למשתמש הודעת ״חיוך״ ו/או שצפית לו בפרופיל ו/או
        שהוספת לינק של משתמש למועדפים שלך. יובהר שהקישור לכרטיס הביקור שלך יהיה גלוי רק במידה ושלחת לו
        ״חיוך״.
      </p>

      <p className="mb-4">
        7.4. כדי לאפשר לך להציג, לשתף ולהפיץ את ״כרטיס הביקור״ שלך ותג השם הוירטואלי שלך. אנחנו נשתמש
        במידע שלך כדי לאפשר לך להציג את ״כרטיס הביקור״ שלך ותג השם הוירטואלי שלך וכדי לאפשר למשתמשים
        אחרים להיכנס ללינק ולצפות בתכנים שהוא מוביל אליהם וכדי שמשתמשים אחרים יוכלו לשלוח לך מסר ״חיוך״,
        לשמור את הדף שלך ברשימות מועדפים ו/או ברשימת ההיסטוריה.
      </p>

      <p className="mb-4">
        7.5. כדי לאפשר למשתמשים אחרים לצפות ב״כרטיס הביקור״ שלך עם מעבר ל״מצב נראה״ ומתן הרשאת מיקום.
        אנחנו נשתמש במידע שלך כדי להציג כרטיס הביקור שלך או של העסק שלך בתוצאות סריקה מבוססת מקום או
        בחיפוש חופשי בשדה ה״חיפוש בקהילה״.
      </p>

      <p className="mb-4">
        7.6. כדי לאפשר לך כנציג לעשות שימוש בשירות עבור הארגון. אנחנו נשתמש במידע שלך על מנת לאפשר לך גישה
        למאפיין הקופה ומסך המכירה אשר משמש את הארגון.
      </p>

      <p className="mb-4">
        7.7. לצורך פיתוח ותחזוקה. הנתונים שנאספו לעיל יכולים לסייע בזיהוי בעיות טכניות, בתהליכי פיתוח ושדרוג האתר,
        האפליקציה והפעילות שלנו, למדידת ביצועים של השירות ו/או יעילות קמפיינים או פרסומות וכן בהבטחת חוויית
        משתמש רציפה וללא תקלות. בנוסף, ביחס למידע אשר יתקבל כאמור לעיל, אנו עשויים לעשות שימוש על מנת
        לשפר את האתר, האפליקציה פעילות החברה והשירותים הניתנים במסגרתם.
      </p>

      <p className="mb-4">
        7.8. לצורך אבטחת מידע. אנו עוקבים אחרי ניסיונות גישה לא מורשים או ניסיונות חדירה לאתרים ו/או לאפליקציות כדי
        להבטיח את הגנת המידע והמשתמשים. פעילות זו כוללת זיהוי והתגוננות מפני מתקפות סייבר, פריצות לאתר,
        ושימוש בלתי מורשה במידע אישי, אשר לשמה אנו עשויים לשמור קבצי לוג ותיעוד של פעילות המשתמשים באתר.
      </p>

      <p className="mb-4">
        7.9. לצורך התגוננות. לצורך התגוננות בהליכים משפטיים, מניעת הונאות, התחזות, זיופים, פעילות בניגוד לתנאי
        השימוש, מדיניות הפרטיות והדין, להגיב לטענות צד שלישי לפיהן תוכן בשירות מפר את זכויותיו ו/או לפיהן מידע
        אישי שלו הועלה לשירות על ידי אחר ללא הסכמתו, מפר את פרטיותו, פוגע בו או משמש למעקב אחריו או
        להטרדתו.
      </p>

      <p className="mb-4">
        7.10. לצורך עמידה בהוראות הדין. אנו עשויים לאסוף ולשמור מידע מסוים כדי לעמוד בדרישות חוקיות החלות עלינו
        לרבות תיעוד פעולות וביצוע דיווחים לרשויות מוסמכות.
      </p>

      <h2 className="text-2xl font-bold mt-6 mb-4">8. אינטראקציה עם מוצרים של צד שלישי</h2>
      <p className="mb-4">
        אנו מאפשרים לך ליצור אינטראקציה עם אתרי אינטרנט, אפליקציות תוכנה, ניידות ומוצרים או שירותים של צד שלישי
        שאינם בבעלותנו או בשליטתנו (כל אחד ״שירות צד שלישי״), כמו אימייל, אפליקציות ארנק שונות, פייסבוק,
        אינסטגרם, לינקדאין, טיק טוק, WhatsApp ואחרים. איננו אחראים לפרקטיות הפרטיות או לתוכן של שירותי צד שלישי
        כאלה, ואתה אחראי לאופן בו אתה משתמש בשירות ולכל תוכן שתספק באמצעותו. אנא שימו לב כי שירותי צד שלישי
        יכולים לאסוף מידע ממך. בהתאם לכך, אנו ממליצים לך לקרוא את התנאים וההגבלות ואת מדיניות הפרטיות של כל
        שירות צד שלישי ולא להיכנס לקישורים לאתרים שאינם מוכרים לך או שאינך בוטח בהם.
      </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">
        9. קבצי עוגיות (קוקיז) ונתונים טכניים אחרים
      </h2>

      <p className="mb-4">
        9.1. עוגיות וטכנולוגיות מעקב אחרות. במסגרת השירותים, אנו עשויים לאסוף אוטומטית מידע מסוים באמצעות
        השימוש שלך בשירותים ובאתרים שלנו ואנו עשויים להשתמש ב-״עוגיות״, קבצי זיהוי אנונימיים וטכנולוגיות מעקב
        אחרות (כמו פיקסלים, מסדי נתונים, יומני שרתים, אחסון מקומי, אחסון אינטרנט של דפדפנים, מטמונים (caches)
        של נתוני יישומים), לצורכי אבטחת מידע, וכן על מנת שנוכל לספק את שירותינו, להציג בפניך מידע מותאם אישית
        ולשפר את חוויית המשתמש במסגרת השימוש באתר. ״עוגייה״ הנה קובץ טקסט קטן המשמש, לדוגמה, לאיסוף
        מידע אודות פעילות באתר, שמירת העדפות משתמש ואימות. עוגיות מסוימות וטכנולוגיות אחרות עשויים לשמש
        לצורך אחזור מידע אישי, כגון כתובת IP. רוב הדפדפנים מאפשרים לשלוט בעוגיות, לרבות אם לאשרן או לא
        לאשרן ואופן הסרתן. ניתן להגדיר את רוב הדפדפנים באופן שתקבל הודעה אם לאשר עוגייה, או שבאפשרותך
        לחסום עוגיות בדפדפן.
      </p>

      <p className="mb-4">
        9.2. כלי ניתוח נתונים. האתרים עשויים להשתמש בכלי הנקרא Google Analytics על מנת לאסוף מידע על
        השימוש באתרים. Google Analytics אוסף מידע כגון תדירות ביקורי המשתמשים באתרים, העמודים בהם הם
        מבקרים ובאלו אתרים הם משתמשים לפני הכניסה לאתרים. אנו משתמשים במידע המתקבל מ-Google
        Analytics על מנת לתחזק ולשפר את האתרים ואת שירותינו. איננו משלבים בין המידע שנאסף במסגרת השימוש
        ב-Google Analytics ובין מידע אישי מזהה. יכולתה של Google להשתמש ולשתף מידע שנאסף באמצעות
        Google Analytics על ביקוריך ושימושיך באתרים, מוגבלת על פי הסכם השירות של Google Analytics,
        המפורסם בכתובת http://www.google.com/analytics/terms/us.html ומדיניות הפרטיות של Google,
        המפורסמת בכתובת http://www.google.com/policies/privacy/. תוכלי לקרוא על האופן בו Google אוספת
        ומעבדת נתונים במסגרת Google Analytics בכתובת http://www.google.com/policies/privacy/partners/.
        באפשרותך למנוע את השימוש בנתוניך על ידי Google Analytics באמצעות הורדה והתקנה של Google
        Analytics Opt-out Browser Add-on, הנמצא בכתובת https://tools.google.com/dlpage/gaoptout.
      </p>

      <p className="mb-4">
        9.3. קבצי לוג. בנוסף לאמור בסעיף ‏6 זה לעיל, ביחס למידע אשר יימסר לנו באמצעים דיגיטליים, אנו עשויים
        להשתמש בקבצי לוג. המידע המופיע בקבצי הלוג כולל כתובת IP, סוג דפדפן, חותמת תאריך/זמן, עמודי
        הפניה/יציאה, פעולות סינון, הקלקות וכל מידע אחר העשוי להימסר לנו מהדפדפן שלך. אנו עשויים להשתמש
        במידע כאמור לצורך ניתוח מגמות, ניהול האתרים, מעקב אחר תעבורת הגולש באתרים ולצורך איסוף מידע
        דמוגרפי. בנוסף, אנו עשויים לאסוף נתוני מכשיר ודפדפן, כולל סוג הדפדפן, סוג המכשיר, מערכת ההפעלה, אזור
        זמן ומידע דומה. כמו כן, אנו עשויים להשתמש בטכנולוגיה מבוססת מיקום, על מנת לסייע לנו לאסוף נתונים
        סטטיסטיים מצטברים, אולם לא נשתמש במידע אישי אשר יכול לזהות אותך לצרכים אלו.
      </p>

      <p className="mb-4">
        9.4. שימוש בשבבים. החברה עשויה לחלק או למכור שבב RFID / NFC (״שבב״), שהוא רכיב חומרה שעשוי להגיע
        בצורות שונות כגון מדבקה לטלפון, כרטיס ביקור, צמיד וכדומה. אם רכשת או קיבלת שבב, הרי שקירוב השבב
        למכשיר בעל התקן NFC פעיל, יפתח את הפרופיל האישי או העסקי של בעל השבב בשירות. שירות זה יהיה זמין
        לך רק אם קיבלת, פיסית, את השבב ושייכת אותו לפרופיל שלך בשירותים. התקנת האפליקציה איננה מתקינה
        ״שבב״ אצלך והשירות מותנה בכך שקיבלת חומרה שהגיעה כאמור מאת החברה. אם קיבלת שבב ואתה עושה בו
        שימוש, עליך לדעת שהפרופיל האישי או העסקי שלך בשירות יעלה במכשיר שאיתו בוצעה ״נשיקה״ פיזית (הנחת
        המכשיר הסורק במרחק של סנטימטרים בודדים מהשבב), גם אם החשבון שלך (בעל השבב) בשירות נמצא במצב
        ״בלתי נראה״ או ״פרטי״ בדומה למצב שבו הצגת קוד QR או שלחת קישור.
      </p>

      <h2 className="text-2xl font-bold mt-6 mb-4">10. אופן שיתוף המידע האישי על ידינו</h2>
      <p className="mb-4">
        אנו לא נעביר את המידע שמסרת לנו לצדדים שלישיים, אלא במקרים המפורטים להלן, ככל שיעלה צורך לעשות כן לטובת
        המטרות לשמן המידע נאסף על ידינו כאמור לעיל:
      </p>

      <p className="mb-4">
        10.1. שיתוף עם משתמשים אחרים בשירותים.
      </p>

      <p className="mb-4">
        10.1.1. ביחס לנתוני המיקום המשוער שלך, הרי שנתוני המיקום המשוער שלך יהיו גלויים רק לנו ולא יהיו גלויים
        למשתמשים אחרים אם כי השירות יודע להציג למשתמש, משתמשים אחרים הנמצאים ברדיוס או
        באזימוט כללי ביחס אליו (בהתאם לאפקט הסריקה המבוקש שנבחר על ידי המשתמש), בסדר הצגה עולה
        או יורד בהתאם למרחק שלהם מהמשתמש, אולם השירות לא יציג את נתוני המיקום שלך או שלהם על
        גבי מפה או באמצעות נתוני כתובת.
      </p>

      <p className="mb-4">
        10.1.2. ביחס לתקשורת שבחרת לקיים עם משתמש אחר (באמצעות שליחת ״חיוך״), תהיה גלויה לנו
        ולמשתמש שקיבל ממך את ה״חיוך״. מידע שלך יישמר בהיסטוריית הצפיות או ברשימות של משתמשים
        אחרים בשירות שצפו בפרופיל שלך.
      </p>

      <p className="mb-4">
        10.2. שיתוף עם צדדים שלישיים. ככל שתיקח חלק בפעילויות ותוכניות שאנו מקיימים בשיתוף עם צדדים שלישיים (כמו
        שותפים עסקיים או בעלי אירועים), אנו עשויים לשתף מידע אישי עם הצדדים השלישיים הרלוונטיים לצורך ביצוע
        הפעילות והתוכנית הרלוונטית מטעמם. השימוש במידע על ידי צדדים שלישיים כפוף למדיניות הפרטיות שלהם.
        בהתאם לכך, אנו ממליצים לך לקרוא את התנאים וההגבלות ואת מדיניות הפרטיות של צדדים שלישיים אלו. אנחנו
        עשויים לשתף עם צדדים שלישיים אלה מידע ביחס לכניסות או יציאות ממרחבים פיזיים בהם השתמשת בשירות
        בכדי להזדהות ו/או להציג את אישור הכניסה שלך ועוד מידע ביחס לארנק שלך, כמו למשל יתרה צבורה שרכשת
        או קיבלת בכדי שאלו יוכלו לאשר או לפסול עסקאות ומידע כללי בנוגע לעסקאות שבוצעו כמו סוג המוצר, כמות,
        תשר שבחרת להשאיר לנותן השירות, נותן השירות, זמן ומיקום העסקה ועוד.
      </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">11. שימוש במידע אנונימי</h2>
    <p className="mb-4">
      אנו עשויים להשתמש במידע אנונימי או סטטיסטי (שאינו מאפשר זיהוי של משתמש אינדיבידואלי)
      למטרות פנימיות וחיצוניות, כולל לגלותו לצדדים שלישיים, כמו למשל כדי לשפר את שירותינו, לרבות חוויית המשתמש
      באתרים ו/או באפליקציות שלנו (כולל באמצעות שימוש בבינה מלאכותית), כדי לפתח תכונות חדשות ולשפר הצעות
      קיימות ולמטרות מחקר, לצדדים שלישיים, לרבות למפרסמים ושותפים.
    </p>
    <h2 className="text-2xl font-bold mt-6 mb-4">12. הסרה</h2>
    <p className="mb-4">
      תוכלו לבחור שלא לקבל מאתנו הודעות פרסומיות בנוגע לפעילות החברה ולשירותיה, באמצעות הסרה באמצעי בו
      נשלחה אליך ההודעה. לתשומת ליבך, אף אם תבחר שלא לקבל מאתנו הודעות פרסומיות, נוכל לשלוח לך הודעות
      שירותיות כדוגמת תגובה לבקשת ״צרו קשר״, או בקשה מנהלית אחרת שתשלח אלינו.
    </p>

    <h2 className="text-2xl font-bold mt-6 mb-4">13. אבטחת מידע</h2>
    <p className="mb-4">
      אנחנו מחזיקים את המידע במאגר מידע רשום בישראל בהתאם לחוק הגנת הפרטיות. אנו מיישמים
      מערכות ונהלים עדכניים לאבטחת מידע בהתאם לסטנדרטים המקובלים על מנת להגן על המידע האישי המצוי
      במערכותינו. בעוד שמערכות ונהלים אלה מצמצמים את הסיכונים לחדירה בלתי-מורשית, אין ביכולתם להעניק בטחון
      מוחלט. לכן, אנו לא מתחייבים שהאתר, האפליקציה והמערכות בהן נשמר המידע, יהיו חסינים באופן מוחלט מפני גישה
      בלתי-מורשית למידע המעובד בו. במקרה של אירוע אבטחת מידע, אנחנו מדווחים על אירועי אבטחת מידע לרשות
      המוסמכת, ופועלים בהתאם להנחיותיה.
    </p>

    <h2 className="text-2xl font-bold mt-6 mb-4">14. הזכויות שלך והגנה על הפרטיות שלך</h2>
    <p className="mb-4">
      אנחנו מכבדים את זכותך לפרטיות ומעוניינים לשמור רק מידע נדרש, עדכני
      ומדויק. חשוב לנו שתדע, שהנך רשאי לעיין במידע עליך המצוי אצלנו, וככל שתמצא שמידע זה אינו נכון, שלם, ברור או
      מעודכן, הנך רשאי לפנות אלינו בבקשה מפורטת לתקן או למחוק את המידע כאמור, בהתאם להוראות חוק הגנת הפרטיות
      וכל התקנות שהותקנו מכוח חוק זה. אנו מזמינים אותך לפנות אלינו בנושא זה ובכל שאלה שנוגעת לפרטיות שלך לקצין
      הפרטיות שלנו באמצעות משלוח דוא״ל לכתובת [כתובת דוא״ל]. אתה יכול בכל עת למחוק את חשבונך בשירות באמצעות
      תפריט ״הגדרות״ – ״מחק את החשבון שלי״, ואם תעשה כך יימחק חשבונך אצלנו על כל תכניו לרבות יומן הפעילות, דף
      אישי, היסטורית סריקות ומועדפים, ואם שלחת או קיבלת ״חיוך״, החיוכים האלה יוצגו למשתמשים אחרים אך ללא
      אפשרות להגיע לדף האישי שלך הואיל וזה נמחק ואיננו קיים יותר בשירות.
    </p>
      <p className="mb-4">
        עודכן לאחרונה: ספטמבר, 2024
      </p>
      <div className="flex justify-center">
        <Button onClick={() => router.back()} variant="default" size="lg">
          {t('return')}
        </Button>
      </div>
    </div>
    </PageContainer>
  );
};

export default PrivacyPolicy;
