'use client';

import React, { useEffect } from 'react';
import { useRouter } from 'next/navigation';
import { Button } from '@/components/ui/button';
import { useTranslations } from 'next-intl';
import PageContainer from '@/components/layout/page-container';


const TermsOfUse = () => {
  const router = useRouter();
  const t = useTranslations();

  return (
    <PageContainer scrollable={true}>
    <div className="container mx-auto px-4 py-8 mt-2">
      <h1 className="text-3xl font-bold mb-6 text-center">תנאי שימוש</h1>
      <p className="mb-4">
        {`ברוכים הבאים לאפליקציה (להלן: ״האפליקציה״) ו/או לאתרי האינטרנט שלנו: https://mizemiapp.com/ ו/או
        https://mizemi.app, ו/אוhttps://shopanda.io, לרבות אתרי המשנה שלהם, תכניהם והשירותים המוצעים בהם (להלן ביחד: 
        "האתר"). שירותים אלה מנוהלים ומתופעלים על ידי חברת שופנדה בע"מ, בעלת הזכויות ומפעילת שירות מיזמי ו/או שופנדה 
        (MIZEMI / Shopanda) (להלן: "החברה").`}
      </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">1. הסכמה לתנאי השימוש</h2>
       <p className="mb-4">
        השימוש בשירות ובכלל זה בתכנים המוצגים בו כפופים לתנאי השימוש שלהלן והנך רשאי
        להשתמש בשירות ובתכנים הכלולים בו בהתאם לכללים המפורטים להלן. אין להשתמש בשירות ובתכנים הכלולים בו באופן
        אחר, אלא אם כן קיבלת את הסכמתה המפורשת של החברה מראש ובכתב. אנא קרא תנאים אלה בעיון ובקפידה, הכניסה
        לשירות והשימוש בו ובתכניו מעידים על הסכמתך ואישורך לאמור בתנאי שימוש אלו. אם אינך מסכים לתנאי השימוש, כולם
        או חלקם, אינך רשאי לעשות שימוש בשירות זה לכל מטרה. יובהר, כי תנאים אלה חלים על השימוש בשירות ובתכנים
        הכלולים בו באמצעות כל מחשב או מכשיר תקשורת אחר (כדוגמת טלפון סלולארי ו/או טאבלט). תנאי שימוש אלה מנוסחים
        בלשון זכר מטעמי נוחות בלבד אולם הם, מתייחסים לגברים ולנשים כאחד.
        </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">2. הסכמה למדיניות הפרטיות</h2>
      <p className="mb-4">
        אנו מכבדים את זכותך לפרטיות ומחויבים לשמור על המידע הפרטי שלך. המדיניות שלנו ביחס לשמירה על פרטיות מפורטת 
        במדיניות הפרטיות ומהווה חלק בלתי נפרד מתנאי שימוש אלו,מדיניות הפרטיות מופיעה בדף הפרופיל. 
      </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">3. הגבלת גיל ויכולת להסכים</h2>
      <p className="mb-4">
         השירות מיועד לאנשים בגיל 18 ומעלה. אם אתם מתחת לגיל 18, עליכם לעיין בתנאי שימוש
        אלה עם ההורה או האפוטרופוס שלכם לפני ביקור או שימוש בשירות כדי לוודא שאתם וההורה או האפוטרופוס שלכם מבינים
        ומסכימים לתנאים אלו. 
         </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">4. שינויים</h2>
      <p className="mb-4">
        החברה שומרת לעצמה  את הזכות לעדכן מעת לעת את תנאי השימוש, והגרסה העדכנית ביותר תופיע בשירות
        תחת לשונית &quot;תנאי שימוש&quot;. אם השינויים ישפיעו בצורה מהותית על הזכויות או על החובות שלך, נודיע לך עליהם מראש
        באמצעות הודעת דוא&quot;ל או באמצעות השירות, והמשך השימוש שלך בשירות לאחר כניסת שינויים כאמור לתוקפם יהווה
        הסכמתך לשינויים.
      </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">5. רישיון</h2>
      <p className="mb-4">
      השימוש בשירות מעניק לך רישיון אישי, לא בלעדי, מוגבל בזמן, בלתי ניתן להעברה, ללא זכות לתת רישיונות משנה
      וניתן לביטול, להשתמש בשירות למטרות אישיות, ללא הזכות למסחר את השירות, בכפוף לתנאי שימוש אלה.      </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">6. חשבון </h2>
      <p className="mb-4">
      6.1. על מנת להשתמש בשירותים, תצטרך ליצור חשבון (להלן:&quot;חשבון&quot;). כדי לייצור חשבון ולהשתמש בשירות, אתה מצהיר
        ומתחייב כדלקמן: (1) מעולם לא הורשעת בעבירת אלימות או בעבירה בעלת גוון מיני כלשהו, (2) מעולם חשבונך
        בשירות לא נחסם, הושהה או נמחק ביוזמתנו, ו-(3) השימוש שלך בשירות ייעשה בכפוף ובהתאם לחוק. אנחנו שומרים
        לעצמנו על הזכות למחוק את חשבונך כמפורט בסעיף 18 להלן ו/או במידה ויתברר כי לא עמדת באיזה מהתנאים
        המקדמיים האלה. אנחנו לא מבצעים כל פעולות חקירה ביחס למידת העמידה בתנאים המקדמיים שלעיל, איננו מציגים
        כל מצג שהמשתמשים בשירות עומדים בתנאים המקדמיים ואיננו אחראים להתנהגות המשתמשים בשירות.
        6.2. אתה מסכים שלא ליצור חשבון עבור אף אחד אחר או להשתמש בחשבון של מישהו אחר ללא רשותו (למעט במקרה
        שבו הורה יוצר חשבון עבור ילדו שטרם מלאו לו 18 שנים ומנהל עבורו אשראי ופרופיל בכדי לאפשר שימוש בארנק ו/או
        בתכונות הקהילתיות). בעת יצירת החשבון שלך, עליך לספק מידע מדויק ומלא. אתה אחראי באופן בלעדי לפעילות
        המתרחשת בחשבונך ועליך לנקוט אמצעי זהירות מתאימים כדי לשמור על פרטי החשבון שלך בטוחים, כולל שימוש
        בסיסמאות חזקות ושמירה על פרטיות המידע שלך. עליך להודיע לחברה מיד על כל הפרת אבטחה או שימוש בלתי
        מורשה בחשבונך. אתה יכול בכל עת למחוק את חשבונך בשירות באמצעות תפריט &quot;הגדרות&quot; – &quot;מחק את החשבון
        שלי&quot; ואם נתקלת בקושי, בפנייה ל-hello@mizemi.app.
        6.3. באפשרותך להירשם לשירות באמצעות פרטי ההתחברות שלך לחשבון שלך בפייסבוק ,אפל, ג&#39;ימייל וכדומה. אם בחרת
        להירשם לשירות באמצעות פרטי ההתחברות שלך כמפורט בסעיף זה, צדדים שלישיים אלו יספקו לנו את שמך, תמונה
      </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">7. תשלומים לחברה</h2>
      <p className="mb-4">
        זכותך לגשת ולהשתמש בשירות, היא כרגע בחינם, אך ייתכן שהחברה תגבה בעתיד תשלום עבור גישה או
        שימוש מסוימים. לא תחויב עבור גישה או שימוש בשירות אלא אם תסכים תחילה לתשלומים כאלה, אך אנא היה מודע לכך שכל
        כשל בתשלום התשלומים החלים עשוי לגרום לכך שלא תהיה לך גישה לחלק מהשירות או כולו.      </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">8. שימוש בטכנולוגיית GPS</h2>
      <p className="mb-4">
      חלק מחוויית המשתמש בשירות מתבססת על טכנולוגיית GPS. על מנת שתוכל ליהנות מכל
      התכונות של השירות, עליך לאשר גישה לשירות לעשות שימוש בנתוני המיקום שלך. לא ניתן לספק תכונות מסוימות של
      השירות ללא טכנולוגיה זו.  
     </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">9. שימוש בשבב RFID / NFC</h2>
      <p className="mb-4">
      אם קיבלת או רכשת מאת החברה שבב RFID / NFC המוביל לפרופיל האישי או העסקי שלך
      בשירות (&quot;שבב&quot;) אזי, בנוסף לכל הוראה אחרת בתנאי שימוש אלה, הינך מצהיר ומאשר כדלקמן: (א) ידוע לך שאנחנו רשאים
      בכל עת וללא הודעה מוקדמת לשנות, להשהות או לבטל את השירות, ואתה מוותר בזאת על כל טענה או תביעה שעניינה
      החזר דמי הרכישה (אם שילמת כאלה) או נזקים שנגרמו לך עקב שינוי, השהיית או ביטול השירות, (ב) השבב נמכר לך
      במצבו כפי שהוא (AS-IS) והשירות שהוא מאפשר לך יינתן בהתאם לזמינותו (AS-AVAILABLE) והחברה איננה מבטיחה
      את תקינות השבב או את זמינות השירות, (ג) אנו לא נותנים כל אחריות לתקינות השבב או שירות לתיקון פגמים או תקלות
      בשבב, ואתה מאשר כי התמורה ששילמת, אם שילמת כזאת, הינה סמלית בלבד וכי נטלת ביודעין את הסיכון שהשבב לא
      יצליח למלא אחר ייעודו, ו-(ד) אנחנו לא נהיה אחראים לכל נזק מכל סוג שהוא, ישיר או עקיף, הנובע מהשימוש בשבב או
      כתוצאה מהיעדר יכולת לעשות בו שימוש.
      </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">{`10. שימוש בפיצ'ר הארנק`}</h2>
      <p className="mb-4">
      פיצ&#39;ר הארנק (Wallet Feature) מאפשר לך לנהל ולבצע עסקאות כספיות באמצעות הארנק
      הדיגיטלי והינו חלק מהשירות שהחברה מספקת. הפיצ&#39;ר כולל אפשרות לבצע תשלומים דרך האפליקציה. כדי להשתמש
      בפיצ&#39;ר של הארנק, אתה צריך להוסיף אמצעי תשלום כגון כרטיסי אשראי או חשבונות בנק. אתה מתחייב לספק מידע נכון
      ומדויק בנוגע לאמצעי התשלום ומתחייב לעדכן את המידע במידת הצורך. כל עסקה המתבצעת דרך הארנק תהיה כפופה
      להסכמות ולתנאים של ספקי השירותים הפיננסיים המעורבים. אנו לא נושאים באחריות לכל נזק או עיכוב הנגרם כתוצאה
      מעסקאות שלא הושלמו כראוי. כל בעיה טכנית יש לדווח לנו בהקדם לצורך בדיקה ותמיכה. כל שימוש לרעה או ניסיון לרמות
      את מערכת הארנק יגרור פעולה משפטית כנגדך. אתה אחראי לכל פעולה המתבצעת דרך הארנק שלך. אנו שומרים על
      הזכות לשנות, להוסיף או להפסיק את הפיצ&#39;ר של הארנק בכל עת וללא התראה מוקדמת. שינויים אלו ייכנסו לתוקף מיד
      לאחר פרסומם. לשאלות או בעיות הקשורות לפיצ&#39;ר של הארנק, ניתן לפנות אל צוות התמיכה שלנו בכתובת
      hello@mizemi.app .      </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">11. התחייבות משתמשים</h2>
      <p className="mb-4">
      החברה מעוניינת להבטיח כי השירות ינוהל באופן תקין וראוי, וכי התכנים השונים ישרתו את
      המשתמשים בצורה מיטבית ובטוחה. לכן, הנך נדרש שלא לבצע את הפעולות הבאות האסורות בתכלית:
      (1) לגלות או להעביר לצד שלישי את פרטי ההתחברות לחשבונך.
      (2) להתחזות לאדם או גוף, פרסום או הפצה של כל חומר פוגעני, שקרי, מטעה.
      (3) למכור, להעניק רישיונות, או לנצל באופן מסחרי כלשהו את השירות, השימוש בו או הגישה אליו מבלי לקבל תחילה את
      הסכמתנו לכך בכתב.
      (4) שינוי, עיבוד, העתקה, שאיבת מידע, פירוק או הרכבה מחדש של כל אחד מרכיבי השירות.
      (5) הפצת &quot;דואר זבל&quot; (spam) או הצפה של שרתי השירות בכל דואר אחר.
      (6) הטענה או שידור של כל חומר המכיל כל סוג של וירוס או קוד מחשב, המיועד להרוס, להפריע, או להגביל את השימוש
      בכל אחד מהמחשבים, השרתים, החומרה והתוכנה המשמשים את החברה לצורך הפעלת השירות. כמו כן אין להפעיל
      או לאפשר להפעיל כל יישום מחשב או כל אמצעי אחר, לרבות תוכנות מסוג Crawlers Robots וכדומה, לשם חיפוש,
      סריקה, העתקה או אחזור אוטומטי של תכנים מתוך השירות. בכלל זה, אין ליצור ואין להשתמש באמצעים כאמור לשם
      יצירת לקט, אוסף או מאגר שיכילו תכנים מהשירות.
      (7) להשמיץ, להתעלל, להטריד, לעקוב, להתנכל או לאיים על משתמשים אחרים באמצעים כלשהם.
      (8) פגיעה בכל דרך שהיא בזכויות יוצרים, סימני מסחר, או כל זכות קניינית אחרת אשר מצויות באתר, לרבות שימוש
      מסחרי כלשהו בשירות ללא קבלת הסכמת החברה בכתב ומראש.
      (9) הצבת האתר או כל חלק ממנה במסגרת (frame) אתר, או כחלק (mirror) מאתר.
      (10) הפרעה בכל דרך שהיא לפעילות השירות.
      (11) למעט כפי שיתאפשר במסגרת הפעילות הרגילה של האתר - איסוף מידע על משתמשים באתר, מכירה, הפצה ו/או
      עשיית שימוש מסחרי במידע הקיים באתר או כל שימוש אחר באופן העלול לפגוע באדם אחר.
      (12) הפצת קישור לאתר מאתר המכיל תכנים פורנוגראפיים, תכנים המעודדים לגזענות או להפליה פסולה, או המנוגדים
      לחוק, או שפרסומם מנוגד לחוק או המעודדים פעילות המנוגדת לחוק, או כזה אשר עלול לפגוע בתדמית החברה או
      האתר או להציג מצג שווא ביחס להשתייכות החברה לקבוצה או מוסד כזה או אחר. החברה לא תישא בכל אחריות לכל
      נזק שייגרם כתוצאה מכל קישור ומכל הצגה או פרסום של תכנים כאמור בכל דרך. הנך נושא באחריות המלאה
      והבלעדית לכל קישור, הצגה או פרסום של התכנים, ומתחייב לשפות את החברה בגין כל נזק שייגרם כתוצאה מכך.
      (13) להשתמש בשירות לכל מטרה בלתי חוקית, בלתי מוסרית או שאיננה מותרת לפי הוראות תנאי שימוש אלו.      </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">12. תכנים בשירות</h2>
      <p className="mb-4">
      התכנים בשירות כוללים תכנים מקוריים של החברה ו/או תכנים שמקורם במשתמשים ו/או תכנים שמקורם בצדדים
      שלישיים. החברה מבקשת להבטיח כי הגלישה והשימוש בשירות יהיו ידידותיים ונעימים לכל הגולשים.
      12.1 תכנים שמקורם במשתמשים. בשירות מתפרסמים תכנים שמקורם במשתמשים. תכנים אלה מתפרסמים באזורים
      המיועדים לכך, כדוגמת כרטיסי הביקור, באזור המיועד לתכני המשתמשים בלבד ובין ביחד עם תכנים של החברה. לאור
      האמור לעיל, בעשותך שימוש בשירות במסגרת שיגור או מסירת תכנים לפרסום בשירות, חלה עליך האחריות המלאה
      והבלעדית לכל תוצאה שתנבע מכך והנך נדרש להימנע מלפרסם בו את התכנים הבאים:
      (1) תכנים בעלי אופי מיני בוטה, מאיימים, גזעניים, או מוציאי לשון הרע.
      (2) תכנים המעודדים לביצוע עבירות פליליות או אזרחיות ו/או אשר מהווים הפרה כלשהי של החוק.
      (3) תכנים הפוגעים בפרטיות.
      (4) תכנים מזיקים ו/או הפוגעים ברגשות הציבור.
      (5) תכנים אשר זכויות הקנין הרוחני בהם אינן שייכות לך.
      (6) תכנים אשר מכילים וירוסי מחשב מכל סוג שהוא.
      (7) תכנים אשר אינם רלוונטיים לפורום או לבלוג בו הנך נמצא.
      (8) כל תוכן הידוע לך שהוא שקרי, מטעה או מסולף.
      (9) כל תוכן המזהה אישית אנשים אחרים, מבלי שנתנו את הסכמתם לפרסום זהותם.
      (10) כל תוכן בעל אופי או תוכן טורדני, מעליב, עוין, מאיים או גס רוח.
      (11) כל תוכן שהגישה אליו חסומה באמצעות סיסמה וכיו&quot;ב, ואינה מתאפשרת באופן חופשי לכל משתמשי האינטרנט.
      12.2 בתנאי שימוש אלה, המונח &quot;תוכן&quot; או &quot;תכנים&quot; משמעם כל מידע מכל מין וסוג, לרבות כל תוכן מילולי, חזותי, קולי,
      אור-קולי (audio-visual) או כל שילוב שלהם וכן עיצובם, עיבודם, עריכתם, הפצתם ודרך הצגתם, לרבות (אך לא רק):
      הודעות, כתבות, סקירות, נתונים, ידיעות, קבצים, ניתוחים, תכנים, הערכות, קישורים, בטקסט, בתמונות ו/או בקול, וכל
      מידע אחר שיועמד לרשות הגולשים באתר בכל אמצעי שהוא, הקיים כיום או שיהיה קיים בעתיד.
      12.3 החברה שומרת לעצמה את הזכות לבדוק את התכנים שמקורם במשתמשים לפני פרסומם ואף לסרב לפרסם
      תכנים אשר לדעתה מפרים מי מהתנאים הנ&quot;ל ו/או עלולים לפגוע בחברה ו/או בשירות ו/או בצד שלישי כלשהו, וכן את
      הזכות למחוק תכנים כאלו בכל עת ומכל סיבה שהיא. אין באמור כדי להטיל כל אחריות על החברה.
      12.4 התכנים שאתה מוסר לשירות יהיו חשופים לכל המשתמשים בשירות. החברה לא תהיה אחראית לכל שימוש
      שייעשה על ידי משתמשים אחרים או כל צד שלישי בתכנים שיפורסמו על-ידך.
      12.5 העלאת תוכן לשירות משמעה שאתה מאשר ומתחייב שאתה בעל הזכויות בקניין הרוחני בתוכן האמור ושפרסומו
      נעשה כדין. אינך מעניק לנו בעלות בזכויות הקניין הרוחני בתכנים שפרסמת בשירות, אולם אתה מעניק לנו ולמשתמשים
      האחרים בשירות רישיון עולמי, בלתי חוזר, שאיננו בלעדי, חינם ונקי מחובת תמלוגים, ניתן להעברה, שניתן להעניק
      מכוחו רישיונות משנה, להשתמש, להעתיק ולהפיץ את התוכן, להכין ממנו יצירות נגזרות, להציגו ולפרסמו בציבור.
      ההיתר הנ&quot;ל ניתן לנו לכל מטרה, לרבות מטרה מסחרית, אולם למשתמשים האחרים בשירות הוא ניתן אך ורק למטרות
      שאינן מסחריות אלא אם כן אישרנו להם מראש ובכתב לעשות שימוש בתוכן שלך לצרכים מסחריים (ולעניין זה אתה
      ממנה אותנו להיות שלוחיך).
      12.6 תכנים שמקורם בצדדים שלישים וקישורים. בשירות ייתכן ותמצא תכנים מאת צדדים שלישיים, קישורים ו/או
      הפניות לאתרי אינטרנט אחרים, מקורות מידע, חשבונות המתנהלים בפלטפורמות שונות כגון, פייסבוק, אינסטגרם,
      לינקדאין, טיק טוק, WhatsApp ואחרים (להלן:&quot;מדיה מקושרת&quot;), יישומים (למשל, אימייל או אפליקציות ארנק שונות),
      גופים וארגונים (להלן:&quot;צדדים שלישיים&quot;). תכנים אלה אינם בשליטת החברה למרות שאנו נעשה מאמצים סבירים
      להשגיח עליהם. בנוסף, הימצאותו של קישור לאתר מסוים ו/או הפנייה כאמור, אינו מעיד על הסכמת החברה לתוכנם
      ואינו מלמד כי תוכן האתר המקושר ו/או הגוף ו/או הארגון ו/או החברה הינם מהימנים או מאושרים על-ידי החברה, וכי
      המידע אשר יימסר על ידם הינו מלא, עדכני או מתאים לשימושך. החברה אינה אחראית לתכנים של צדדים שלישיים
      ואינה אחראית לכל תוצאה שתיגרם מהשימוש בהם או מהסתמכות עליהם. החברה אינה מתחייבת כי כל הקישורים
      שימצאו באתר יהיו תקינים או בטוחים. המשתמש, והמשתמש בלבד, נושא באחריות להשלכות השיתוף של משתמשים
      אחרים למדיה מקושרת, ולכל שימוש או הסתמכות על התכנים המצויים שם, לרבות לסיכוני הסייבר, אבטחת המידע
      ואפשרות ההדבקות בווירוסים. המשתמש מצהיר כי הוא מקיים וימשיך לקיים את כל ההוראות, תנאי השימוש ומדיניות
      הקניין הרוחני של צדדים שלישיים ושל הפלטפורמות שעליהן מתנהלת מדיה מקושרת.
       </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">13. מתן פרטים ומסירת מידע</h2>
      <p className="mb-4">
      הנך מתחייב ומאשר כי כל המידע, הנתונים, התכנים והמסמכים שתמסור במסגרת השירות,
      מלאים ומדויקים. ידוע לך כי החברה מסתמכת על המידע, וכי הטעיה או מסירת מידע כוזב או בניגוד לדין עלולה להוות עוולה 
      אזרחית ואף מעשה פלילי. 
       </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">14. העדר מצגים ואחריות</h2>
      <p className="mb-4">
      החברה מספקת את השירות, המידע והתכנים במסגרתו כמו שהם (IS-AS) ובהתאם לזמינות (AS-
      AVAILABLE), ואינה נותנת כל מצג ו/או הבטחה בדבר אחריות, מפורשת או משתמעת, חוקית או אחרת, בכל התקשרות עם
      החברה, נציגיה, או בכל הקשור לתוכנה או לשירות, ליכולת להשתמש בהם, לזמינותם, דיוקם, רציפותם, תקינותם, איכותם,
      אמינותם, התאמתם למטרה כלשהי, שלמותם, אמיתות תוכנם, שימושיותם, או יעילותם, של השירות ו/או של כל תוכן הקיים
      בשירות (לרבות תוכן משתמשים) או שהמשתמש הופנה אליהם באמצעות קישורים ו/או של כל תוצאות, נתונים או מידע אחר
      שהושג או שהופק באמצעות השירות.
       </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">15. הגבלת אחריות</h2>
      <p className="mb-4">
      15.1 בשום מקרה החברה ואיזה מבעלי מניותיה, מנהליה, נושאי המשרה בה, עובדיה ונותני השירותים שלה או מי
      מחבריה הקשורים לא יהיו אחראיים עבור: (1) כל נזק תוצאתי, עקיף, מיוחד, מקרי ו/או עונשי, (2) כל אובדן רווחים,
      אובדן עסקים, אובדן הכנסות ו/או אובדן חסכונות צפויים, (3) כל אובדן או נזק לנתונים, מוניטין ו/או רצון טוב, ו/או (ד)
      עלות רכישת כל מוצרים או שירותים חלופיים.
      15.2 האחריות המצטברת של החברה במסגרת או בקשר לתנאי שימוש אלה לא תעלה על הנמוך מבין: (א) 5 דולרים
      אמריקאים או (ב) הסכומים ששולמו בפועל על ידך (אם בכלל) לחברה במהלך 3 החודשים שקדמו לתאריך בו אתה מגיש
      את התביעה שלך.
      15.3 ההגבלות וההוצאות המפורטות לעיל יחולו: (א) במידה המרבית המותרת על פי החוק החל, (ב) גם אם החברה
      הוזהרה או הייתה מודעת לאפשרות של אובדן, נזק או עלויות, (ג) אף אם כל סעד בתנאי שימוש אלו אינו ממלא את
      המטרה לה נועד; ו-(ד) על אף כל תיאוריה ו/או בסיס האחריות אשר יהיו (לרבות, מבלי לגרוע מכלליות האמור, הפרת
      הסכם, נזיקין, רשלנות או אחריות קפידה).
      15.4 ככל ועל פי דין אין אפשרות להחריג או להגביל נזקים עקיפים או תוצאתיים, או נזקים אחרים, ובמידה שזה רלוונטי
      עבורך, החרגות והגבלות אלו לא יחולו. יתרה מכך, אין להבין מתנאי שימוש אלו כי ישנה החרגה או הגבלה של אחריות
      למוות או פציעה אישית הנגרמת מרשלנות, או להונאה או הצגת עובדות שקריות.
        </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">16. שיפוי</h2>
      <p className="mb-4">
      אתה מתחייב לשפות את החברה בגין כל תביעה, נזק, התחייבות, הפסד, חבות, עלות והוצאה (לרבות הוצאות
      משפטיות ושכר טרחה סביר של עורכי דין) הנובעים מ: (1) השימוש שלך בשירות או חוסר היכולת להשתמש בה, (2) התכנים
      שאתם מעלה לשירות, (3) הפרה של כל סעיף מתנאי שימוש אלו, (4) הפרתך את זכויות הקניין הרוחני או זכויות הפרטיות
      של צד שלישי כלשהו, ו-(5) הפרה מצידך של חוק כלשהו.      </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">17. קניין רוחני</h2>
      <p className="mb-4">
      למעט האמור בסעיף ‏12 לעיל, כל זכויות הקניין הרוחני בשירות וכל המידע המופיע בשירות נמצא בבעלות
      הבלעדית של החברה או של צד שלישי, שהרשה לחברה להשתמש בו ואין לראות במידע ובתכנים המסופקים על ידה כמקנים
      רישיון כלשהו או זכויות כלשהן בקניין הרוחני של החברה או של צדדים שלישיים. אין להעתיק או לפרסם את דפי האתר ו/או
      לעשות בהם או במידע ובתכנים שבתוך השירות שימוש כלשהו, לרבות שימוש מסחרי, ללא ההסכמה המפורשת מראש
      ובכתב של החברה. זכויות היוצרים בכל הקשור לשירות, לרבות עיצובו, סימניו המסחריים (כמו השם &quot;MIZEMI&quot;, הלוגו של
      MIZEMI וסימנים מסחריים ו/או סמלי שירות אחרים) הינם רכוש החברה וכן בכל פעולה אחרת בשירות הייחודית והבלעדית
      לחברה, שמורים לחברה או מי מטעמה. למען הסר ספק, אין בעשיית או אפשרות שימוש בשירות בכדי להעניק למשתמש
      זכות כלשהי בקניין הרוחני של החברה. אין למכור ו/או להשכיר ו/או להעתיק ו/או לשכפל ו/או להעביר ו/או להציג בפומבי ו/או
      להפיץ ו/או לעבד ו/או לשנות ו/או לתרגם ו/או לנצל למטרה מסחרית כלשהי, באופן ישיר ו/או עקיף ו/או לעשות שימוש כלשהו
      בתוכן ו/או בסימני המסחר המוצגים בשירות, אלא בקבלת הסכמת החברה מראש ובכתב ובהתאם לשיקול דעתה הבלעדי של
      החברה.      
      </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">18. סיום השירות</h2>
      <p className="mb-4">
      18.1 החברה רשאית, על-פי שיקול דעתה הבלעדי, לחסום ו/או לבטל גישת משתמשים לשירות, ובין היתר, בקרות אחד
      מהמקרים הבאים: המשתמש ביצע מעשה או מחדל בלתי חוקי ו/או הפר תנאי מתנאי השימוש, המשתמש ביצע מעשה
      או מחדל שיש בו כדי לפגוע בחברה ו/או במי מטעמה ו/או בפעילות התקינה של השירות ו/או בכל צד שלישי, המשתמש
      מסר פרטים שגויים ו/או מטעים או מכל סיבה אחרת כפי שנמצא לנכון, בהתאם לשיקול דעת החברה הבלעדי והמוחלט.
      החברה רשאית להסיר או להשהות את השירות או לשנות את השירות או חלקים מהשירות, מראה, זמינות התכנים
      הניתנים בו, באופן זמני או קבוע וזאת ללא צורך להודיע לך על כך מראש.
      18.2 עם סיום תנאי שימוש אלו, זכותך לגשת ולהשתמש בשירות תסתיים אוטומטית ותיחשב כמבוטלת. סעיפים ‏12.5 ,
      ‏14 , ‏15 , ‏16 , ‏17 , ‏18.2 , ו- ‏20 עד ‏24 יישארו בתוקף לאחר סיום תנאי שימוש אלו. הסיום לא ישפיע על כל זכויות
      והתחייבויות שנצברו עד למועד הסיום.      </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">19. פיקוח על ייצוא</h2>
      <p className="mb-4">
      הינך מצהיר ומתחייב כי (א) אינך נמצא במדינה הנתונה לאמברגו של ממשלת ארה&quot;ב או הנמצאת ברשימת
      &quot;מדינות תומכות טרור&quot; כפי שנקבע מפעם לפעם ע&quot;י ממשלת ארה&quot;ב, ו- (ב) אינך רשום ברשימות גורמים &quot;מוגבלים&quot; או
      &quot;מנועים&quot; כפי שנקבע מפעם לפעם ע&quot;י ממשלת ארה&quot;ב.      </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">20. אופן הבירור של טענות</h2>
      <p className="mb-4">
      20.1 אם אתה סבור כי משתמש אחר נוהג שלא כראוי, ואיזה מהתכנים שהוא מפרסם או שתקשורת המשתמש שלו עמך
      מפרים תנאי שימוש אלה, לרבות באמצעות פרסום תוכן פוגעני, אלים או מבזה, נבקשך לדווח על כך מיד לרשויות
      המתאימות, ולנו מהעמוד האישי שלו על ידי לחיצה על כפתור &quot;דיווח&quot;.
      20.2 החברה מכבדת את זכויות היוצרים ואת הקניין הרוחני שלך ושל אחרים. אם אתה סבור כי זכויות אלה הופרו בצורה
      כלשהי, נבקשך לדווח לנו על כך מיד בכתב, ולכלול בדיווח שלך את הפרטים ואת המסמכים הבאים: (א) אישור כי אתה
      מוסמך לפעול בשם בעל הזכויות שהפרתן נטענת, (ב) תיאור של העבודה המוגנת שאתה הטוען להפרתה, (ג) תיאור של
      החומרים או של הפעילות שלגביהם נטען שהם מפרים ביחד עם המידע הדרוש לאיתורם (כגון כתובת URL או צילום
      מסך של הפעילות המפרה), (ד) פרטי ההתקשרות המלאים עמך (כגון שם מלא, כתובת דוא&quot;ל וטלפון), (ה) הצהרה שלך
      לפיה אתה מאמין בתום לב שהשימוש המפר כפי שנעשה איננו מהווה שימוש מותר מאת בעל הזכויות ו/או על פי דין, (ו)
      הצהרה שלך לפיה כל המידע המפורט בפנייתך הינו מדויק וכי אתה הבעלים של הזכויות שהפרתן נטענת או שהינך
      מורשה מאת בעל זכויות כאמור לפעול בשמו ועבורו.
        </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">21. דין וסמכות שיפוט</h2>
      <p className="mb-4">
            על תנאי שימוש אלו יחולו אך ורק דיני מדינת ישראל. מקום השיפוט הבלעדי לכל עניין הנוגע לתנאי
      השימוש והשימוש בשירות לרבות מדיניות הפרטיות הינו בבתי המשפט המוסמכים בעיר תל אביב – יפו בישראל. בכפוף לדין,
      אם תרצה לתבוע את החברה בכל עילה שהיא הקשורה בשירות או בתוכנה, הינך חייב לעשות זאת בתוך שנה אחת מהיום
      שבו נודעה לך עילת התביעה, אחרת, זכות התביעה שלך תיחסם ותיחשב כמי שוויתר על זכותו זו. 
       </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">22. כללי</h2>
      <p className="mb-4">
      תנאי שימוש אלה, ביחד עם מדיניות הפרטיות מייצגים את ההסכם המלא בין החברה ובינך בנוגע לנושא נשוא תנאי
      שימוש אלו, ומחליף ומבטל כל הסכמים, הבנות והצהרות קודמות ועכשוויות, בעל פה ובכתב, בינך לבין החברה בנוגע לנושא
      זה. שום ויתור, הימנעות מפעולה או מתן ארכה הניתנים על ידי החברה לא יחשבו כוויתור על זכויותיה ולא יפגעו בזכותה
      לממש זכויותיה בכל עת שתמצא לנכון. וויתור מצד החברה חייב להיות חתום כדין על ידי נציג מוסמך של החברה ויהיה תקף
      רק במקרה הספציפי שבו ניתן. אינך רשאי להעביר או להמחות לאחר איזה מזכויותיך וחובותיך על פי תנאי שימוש אלה וכל
      העברה או המחאה שלא אושרה על ידי החברה מראש ובכתב, תהיה בטלה. כותרות הסעיפים נכתבו לשם הנוחות בלבד והן
      לא תובאנה בחשבון לצורך פירוש תנאי שימוש אלו. 
       </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">23. יצירת קשר</h2>
      <p className="mb-4">
      ניתן ליצור קשר על החברה בכל עניין באמצעות הדוא&quot;ל hello@mizemi.app ואנו נשתדל לטפל בפנייתך תוך
      זמן סביר.
        </p>
      <h2 className="text-2xl font-bold mt-6 mb-4">24. תנאי שימוש של אפל</h2>
      <p className="mb-4">
      24.1. ההוראות שלהלן יחולו על כל אפליקציה שתרכוש מחנות איי-טיונס: מבלי לגרוע מסעיפי הגבלת אחריות והיעדר
      מצגים המפורטים בתנאי שימוש אלו, אתה מאשר ומסכים כי: (א) תנאי שימוש אלו נכרתו אך ורק בינך לבין החברה, ולא
      עם Inc Apple (להלן: &quot;אפל&quot;), (ב) בכפוף לאמור בתנאי שימוש אלו, החברה הינה האחראית הבלעדית על האפליקציה
      והתוכן אשר נכלל בה, (ג) החברה האחראית הבלעדית לספק שירותי תמיכה ותחזוקה לאפליקציה בכפוף לאמור בתנאי
      שימוש אלו או כנדרש בהתאם לדין הרלוונטי, (ד) על אפל לא חלה כל אחריות חובה לספק שירותי תחזוקה או תמיכה
      כלשהם בקשר לאפליקציה, (ה) החברה ולא אפל אחראית לטפל בכל תביעה שלך או של כל צד שלישי בקשר
      לאפליקציה או בהחזקה ו/או בשימוש שלך באפליקציה לרבות, בין השאר, אך לא רק: (1) תביעות כי האפליקציה אינה
      מתאימה לכל דרישה חוקית או הסדר רלוונטי; ו - (2) תביעות אשר נובעות מחקיקה בקשר להגנה על הצרכן או
      מחקיקה דומה אחרת; (ו) במקרה של תביעה של צד שלישי שהאפליקציה או ההחזקה או השימוש מצדך באפליקציה
      מפירים את זכויות הקניין הרוחני של צד שלישי, אפל לא תהיה אחראית לחקור, להגן, להסדיר את התביעה ולסלק כל
      הפרה כזו של תביעה של הפרה של זכויות קניין רוחני, (ז) אפל והחברות הבנות של אפל, הן מוטבים של הסכם זה
      לטובת צד שלישי, וכי מעצם ההסכמה שלך לתנאים ולהוראות של תנאי השימוש, מוקנית לאפל זכות (ואפל תחשב כמי
      שקיבלה על עצמה זכות זו) לאכוף תנאי שימוש אלו נגדך, כצד שלישי שהוא מוטב של תנאי שימוש אלו.
      24.2. מבלי לגרוע מכל תנאי בתנאי השימוש הללו, במידה והורדת את האפליקציה מ- Apple App Store אז השימוש
      באפליקציה מוגבל לרישיון בלתי ניתן להעברה להשתמש באפליקציה על מוצר iOS (כמוגדר להלן) שבבעלותך או
      שליטתך ורק כפי שמורשה בכללי השימוש המפורטים בתנאי App Store Terms of Service. &quot;מוצר iOS&quot; הינו מוצר
      ממותג של אפל אשר מפעיל את iOS.
      24.3. במידה ויש לך שאלות, תלונות בקשר לאפליקציה אנא פנה אל החברה בכתובת הבאה:
      מייל: hello@mizemi.app
      כתובת: שדרות רוטשילד 72, תל אביב
      טלפון: 0545712292 
      <br></br>
      עודכן לאחרונה: ספטמבר, 2024
       </p>
      <div className="flex justify-center">
        <Button onClick={() => router.back()} variant="default" size="lg">
          {t('return')}
        </Button>
      </div>
    </div>
    </PageContainer>
  );
};

export default TermsOfUse;
